"""
Формат ввода

Вводится целое неотрицательное число N (N≤100).

Формат вывода

Выведите 2 в степени N.
"""

print(2 ** int(input()))
